# Pandas

In computer programming, pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series.

### Installation
```pip3 install pandas
```


___
# Series

Arrays VS Series
* A Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. 
* Can hold any Python object, not necessary numeric.

In [1]:
import numpy as np
import pandas as pd

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

**Using Lists**

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

**Using NumPy Arrays**

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

**Using Dictionary**

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Data in a Series

A pandas Series can hold a variety of object types:

In [9]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

### Using an Index

In [10]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [11]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [12]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [13]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [14]:
ser2['Italy']

5

Operations are then also done based off of index:

In [15]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames

We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [16]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [17]:
df = pd.DataFrame(randn(10,4),index='A B C D E F G H I J'.split(),columns='W X Y Z'.split())

In [18]:
df

          W         X         Y         Z
A  0.428913 -1.010480  0.741639 -0.107996
B -0.763070 -0.651191 -0.295761  1.410149
C -0.363714  1.136162  0.182217 -0.332655
D  0.437853  1.187005 -0.882897  0.473466
E  0.871908  0.375402 -0.774338 -0.414428
F  0.805248 -0.055570  0.668046  1.262837
G -1.451306 -0.364546  0.109337  0.236858
H  1.233498  0.660228  0.111574 -0.258214
I -0.968920 -0.957350  2.248431 -0.795026
J -0.550355 -1.415167 -1.830578  0.647864

In [19]:
#returns first 5 rows only
df.head()

          W         X         Y         Z
A  0.428913 -1.010480  0.741639 -0.107996
B -0.763070 -0.651191 -0.295761  1.410149
C -0.363714  1.136162  0.182217 -0.332655
D  0.437853  1.187005 -0.882897  0.473466
E  0.871908  0.375402 -0.774338 -0.414428

In [20]:
#get column by column name
df['W']

A    0.428913
B   -0.763070
C   -0.363714
D    0.437853
E    0.871908
F    0.805248
G   -1.451306
H    1.233498
I   -0.968920
J   -0.550355
Name: W, dtype: float64

In [21]:
#get multiple columns by column names
df[['W','Z']]

          W         Z
A  0.428913 -0.107996
B -0.763070  1.410149
C -0.363714 -0.332655
D  0.437853  0.473466
E  0.871908 -0.414428
F  0.805248  1.262837
G -1.451306  0.236858
H  1.233498 -0.258214
I -0.968920 -0.795026
J -0.550355  0.647864

In [22]:
#list all columns
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [23]:
#condition on columns
df[df.columns[2:]]

          Y         Z
A  0.741639 -0.107996
B -0.295761  1.410149
C  0.182217 -0.332655
D -0.882897  0.473466
E -0.774338 -0.414428
F  0.668046  1.262837
G  0.109337  0.236858
H  0.111574 -0.258214
I  2.248431 -0.795026
J -1.830578  0.647864

In [24]:
#everything is about series
type(df['W'])

pandas.core.series.Series

**Create new column**

In [25]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  0.428913 -1.010480  0.741639 -0.107996  1.170552
B -0.763070 -0.651191 -0.295761  1.410149 -1.058831
C -0.363714  1.136162  0.182217 -0.332655 -0.181496
D  0.437853  1.187005 -0.882897  0.473466 -0.445044
E  0.871908  0.375402 -0.774338 -0.414428  0.097570
F  0.805248 -0.055570  0.668046  1.262837  1.473294
G -1.451306 -0.364546  0.109337  0.236858 -1.341968
H  1.233498  0.660228  0.111574 -0.258214  1.345072
I -0.968920 -0.957350  2.248431 -0.795026  1.279511
J -0.550355 -1.415167 -1.830578  0.647864 -2.380933

**Drop column**

In [26]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.428913 -1.010480  0.741639 -0.107996
B -0.763070 -0.651191 -0.295761  1.410149
C -0.363714  1.136162  0.182217 -0.332655
D  0.437853  1.187005 -0.882897  0.473466
E  0.871908  0.375402 -0.774338 -0.414428
F  0.805248 -0.055570  0.668046  1.262837
G -1.451306 -0.364546  0.109337  0.236858
H  1.233498  0.660228  0.111574 -0.258214
I -0.968920 -0.957350  2.248431 -0.795026
J -0.550355 -1.415167 -1.830578  0.647864

In [27]:
#to do that on the same dataframe, use whether "inplace" parameter, or assign value
df.drop('new',axis=1,inplace=True)
#or
#df = df.drop('new',axis=1)

In [28]:
df.head()

          W         X         Y         Z
A  0.428913 -1.010480  0.741639 -0.107996
B -0.763070 -0.651191 -0.295761  1.410149
C -0.363714  1.136162  0.182217 -0.332655
D  0.437853  1.187005 -0.882897  0.473466
E  0.871908  0.375402 -0.774338 -0.414428

**dropping rows**

In [29]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.428913 -1.010480  0.741639 -0.107996
B -0.763070 -0.651191 -0.295761  1.410149
C -0.363714  1.136162  0.182217 -0.332655
D  0.437853  1.187005 -0.882897  0.473466
F  0.805248 -0.055570  0.668046  1.262837
G -1.451306 -0.364546  0.109337  0.236858
H  1.233498  0.660228  0.111574 -0.258214
I -0.968920 -0.957350  2.248431 -0.795026
J -0.550355 -1.415167 -1.830578  0.647864

**Selecting rows**

In [30]:
df.loc['A']

W    0.428913
X   -1.010480
Y    0.741639
Z   -0.107996
Name: A, dtype: float64

Or select based off of position instead of label

In [31]:
df.iloc[2]

W   -0.363714
X    1.136162
Y    0.182217
Z   -0.332655
Name: C, dtype: float64

**Selecting subset of rows and columns**

In [32]:
df.loc['B','Y']

-0.2957607761709156

In [33]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.428913  0.741639
B -0.763070 -0.295761

In [34]:
df.iloc[[0,1],[3,2]]

          Z         Y
A -0.107996  0.741639
B  1.410149 -0.295761

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [35]:
df

          W         X         Y         Z
A  0.428913 -1.010480  0.741639 -0.107996
B -0.763070 -0.651191 -0.295761  1.410149
C -0.363714  1.136162  0.182217 -0.332655
D  0.437853  1.187005 -0.882897  0.473466
E  0.871908  0.375402 -0.774338 -0.414428
F  0.805248 -0.055570  0.668046  1.262837
G -1.451306 -0.364546  0.109337  0.236858
H  1.233498  0.660228  0.111574 -0.258214
I -0.968920 -0.957350  2.248431 -0.795026
J -0.550355 -1.415167 -1.830578  0.647864

In [36]:
df>0

       W      X      Y      Z
A   True  False   True  False
B  False  False  False   True
C  False   True   True  False
D   True   True  False   True
E   True   True  False  False
F   True  False   True   True
G  False  False   True   True
H   True   True   True  False
I  False  False   True  False
J  False  False  False   True

In [37]:
df[df>0]

          W         X         Y         Z
A  0.428913       NaN  0.741639       NaN
B       NaN       NaN       NaN  1.410149
C       NaN  1.136162  0.182217       NaN
D  0.437853  1.187005       NaN  0.473466
E  0.871908  0.375402       NaN       NaN
F  0.805248       NaN  0.668046  1.262837
G       NaN       NaN  0.109337  0.236858
H  1.233498  0.660228  0.111574       NaN
I       NaN       NaN  2.248431       NaN
J       NaN       NaN       NaN  0.647864

In [38]:
df[df['W']>0]

          W         X         Y         Z
A  0.428913 -1.010480  0.741639 -0.107996
D  0.437853  1.187005 -0.882897  0.473466
E  0.871908  0.375402 -0.774338 -0.414428
F  0.805248 -0.055570  0.668046  1.262837
H  1.233498  0.660228  0.111574 -0.258214

In [39]:
df[df['W']>0]['Y']

A    0.741639
D   -0.882897
E   -0.774338
F    0.668046
H    0.111574
Name: Y, dtype: float64

In [40]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.741639 -1.010480
D -0.882897  1.187005
E -0.774338  0.375402
F  0.668046 -0.055570
H  0.111574  0.660228

For two conditions you can use | and & with parenthesis:

In [41]:
df[(df['W']>0) | (df['Y'] > 1)]

          W         X         Y         Z
A  0.428913 -1.010480  0.741639 -0.107996
D  0.437853  1.187005 -0.882897  0.473466
E  0.871908  0.375402 -0.774338 -0.414428
F  0.805248 -0.055570  0.668046  1.262837
H  1.233498  0.660228  0.111574 -0.258214
I -0.968920 -0.957350  2.248431 -0.795026

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [47]:
df = df[:"E"]
df

          W         X         Y         Z
A  0.428913 -1.010480  0.741639 -0.107996
B -0.763070 -0.651191 -0.295761  1.410149
C -0.363714  1.136162  0.182217 -0.332655
D  0.437853  1.187005 -0.882897  0.473466
E  0.871908  0.375402 -0.774338 -0.414428

In [48]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  0.428913 -1.010480  0.741639 -0.107996
1     B -0.763070 -0.651191 -0.295761  1.410149
2     C -0.363714  1.136162  0.182217 -0.332655
3     D  0.437853  1.187005 -0.882897  0.473466
4     E  0.871908  0.375402 -0.774338 -0.414428

In [49]:
newind = 'CA NY WY OR CO'.split()

In [50]:
df['States'] = newind

In [51]:
df

          W         X         Y         Z States
A  0.428913 -1.010480  0.741639 -0.107996     CA
B -0.763070 -0.651191 -0.295761  1.410149     NY
C -0.363714  1.136162  0.182217 -0.332655     WY
D  0.437853  1.187005 -0.882897  0.473466     OR
E  0.871908  0.375402 -0.774338 -0.414428     CO

In [52]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.428913 -1.010480  0.741639 -0.107996
NY     -0.763070 -0.651191 -0.295761  1.410149
WY     -0.363714  1.136162  0.182217 -0.332655
OR      0.437853  1.187005 -0.882897  0.473466
CO      0.871908  0.375402 -0.774338 -0.414428

In [53]:
df

          W         X         Y         Z States
A  0.428913 -1.010480  0.741639 -0.107996     CA
B -0.763070 -0.651191 -0.295761  1.410149     NY
C -0.363714  1.136162  0.182217 -0.332655     WY
D  0.437853  1.187005 -0.882897  0.473466     OR
E  0.871908  0.375402 -0.774338 -0.414428     CO

In [54]:
df.set_index('States',inplace=True)

In [55]:
df

               W         X         Y         Z
States
CA      0.428913 -1.010480  0.741639 -0.107996
NY     -0.763070 -0.651191 -0.295761  1.410149
WY     -0.363714  1.136162  0.182217 -0.332655
OR      0.437853  1.187005 -0.882897  0.473466
CO      0.871908  0.375402 -0.774338 -0.414428

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [63]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [64]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [65]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [66]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [67]:
df.dropna(thresh=2, axis=0)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [68]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [69]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Merging, Joining, and Concatenating

In [70]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [71]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [72]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [73]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [74]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [76]:
new=pd.concat([df1,df2,df3],axis=1)
new

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [77]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K7', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [78]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [79]:
right

  key   C   D
0  K7  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [80]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K1  A1  B1  C1  D1
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [81]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [82]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [83]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [84]:
pd.merge(left, right, on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [85]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [86]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [87]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [88]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [89]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [90]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [91]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [92]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3